MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ192GB106/mcu.h
#define _I2C3STAT_TBF_POSITION                   0x00000000
#define _I2C3STAT_TBF_MASK                       0x00000001
#define _I2C3STAT_TBF_LENGTH                     0x00000001

#define _I2C3STAT_RBF_POSITION                   0x00000001
#define _I2C3STAT_RBF_MASK                       0x00000002
#define _I2C3STAT_RBF_LENGTH                     0x00000001

#define _I2C3STAT_R_NOT_W_POSITION               0x00000002
#define _I2C3STAT_R_NOT_W_MASK                   0x00000004
#define _I2C3STAT_R_NOT_W_LENGTH                 0x00000001

#define _I2C3STAT_S_POSITION                     0x00000003
#define _I2C3STAT_S_MASK                         0x00000008
#define _I2C3STAT_S_LENGTH                       0x00000001

#define _I2C3STAT_P_POSITION                     0x00000004
#define _I2C3STAT_P_MASK                         0x00000010
#define _I2C3STAT_P_LENGTH                       0x00000001

#define _I2C3STAT_D_NOT_A_POSITION               0x00000005
#define _I2C3STAT_D_NOT_A_MASK                   0x00000020
#define _I2C3STAT_D_NOT_A_LENGTH                 0x00000001

#define _I2C3STAT_I2COV_POSITION                 0x00000006
#define _I2C3STAT_I2COV_MASK                     0x00000040
#define _I2C3STAT_I2COV_LENGTH                   0x00000001

#define _I2C3STAT_IWCOL_POSITION                 0x00000007
#define _I2C3STAT_IWCOL_MASK                     0x00000080
#define _I2C3STAT_IWCOL_LENGTH                   0x00000001

#define _I2C3STAT_ADD10_POSITION                 0x00000008
#define _I2C3STAT_ADD10_MASK                     0x00000100
#define _I2C3STAT_ADD10_LENGTH                   0x00000001

#define _I2C3STAT_GCSTAT_POSITION                0x00000009
#define _I2C3STAT_GCSTAT_MASK                    0x00000200
#define _I2C3STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C3STAT_BCL_POSITION                   0x0000000A
#define _I2C3STAT_BCL_MASK                       0x00000400
#define _I2C3STAT_BCL_LENGTH                     0x00000001

#define _I2C3STAT_TRSTAT_POSITION                0x0000000E
#define _I2C3STAT_TRSTAT_MASK                    0x00004000
#define _I2C3STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C3STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C3STAT_ACKSTAT_MASK                   0x00008000
#define _I2C3STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C3STAT_R_W_POSITION                   0x00000002
#define _I2C3STAT_R_W_MASK                       0x00000004
#define _I2C3STAT_R_W_LENGTH                     0x00000001

#define _I2C3STAT_D_A_POSITION                   0x00000005
#define _I2C3STAT_D_A_MASK                       0x00000020
#define _I2C3STAT_D_A_LENGTH                     0x00000001

#define _SPI3STAT_SPIRBF_POSITION                0x00000000
#define _SPI3STAT_SPIRBF_MASK                    0x00000001
#define _SPI3STAT_SPIRBF_LENGTH                  0x00000001

#define _SPI3STAT_SPITBF_POSITION                0x00000001
#define _SPI3STAT_SPITBF_MASK                    0x00000002
#define _SPI3STAT_SPITBF_LENGTH                  0x00000001

#define _SPI3STAT_SISEL_POSITION                 0x00000002
#define _SPI3STAT_SISEL_MASK                     0x0000001C
#define _SPI3STAT_SISEL_LENGTH                   0x00000003

#define _SPI3STAT_SRXMPT_POSITION                0x00000005
#define _SPI3STAT_SRXMPT_MASK                    0x00000020
#define _SPI3STAT_SRXMPT_LENGTH                  0x00000001

#define _SPI3STAT_SPIROV_POSITION                0x00000006
#define _SPI3STAT_SPIROV_MASK                    0x00000040
#define _SPI3STAT_SPIROV_LENGTH                  0x00000001

#define _SPI3STAT_SRMPT_POSITION                 0x00000007
#define _SPI3STAT_SRMPT_MASK                     0x00000080
#define _SPI3STAT_SRMPT_LENGTH                   0x00000001

#define _SPI3STAT_SPIBEC_POSITION                0x00000008
#define _SPI3STAT_SPIBEC_MASK                    0x00000700
#define _SPI3STAT_SPIBEC_LENGTH                  0x00000003

#define _SPI3STAT_SPISIDL_POSITION               0x0000000D
#define _SPI3STAT_SPISIDL_MASK                   0x00002000
#define _SPI3STAT_SPISIDL_LENGTH                 0x00000001

#define _SPI3STAT_SPIEN_POSITION                 0x0000000F
#define _SPI3STAT_SPIEN_MASK                     0x00008000
#define _SPI3STAT_SPIEN_LENGTH                   0x00000001

#define _SPI3STAT_SISEL0_POSITION                0x00000002
#define _SPI3STAT_SISEL0_MASK                    0x00000004
#define _SPI3STAT_SISEL0_LENGTH                  0x00000001

#define _SPI3STAT_SISEL1_POSITION                0x00000003
#define _SPI3STAT_SISEL1_MASK                    0x00000008
#define _SPI3STAT_SISEL1_LENGTH                  0x00000001

#define _SPI3STAT_SISEL2_POSITION                0x00000004
#define _SPI3STAT_SISEL2_MASK                    0x00000010
#define _SPI3STAT_SISEL2_LENGTH                  0x00000001

#define _SPI3STAT_SPIBEC0_POSITION               0x00000008
#define _SPI3STAT_SPIBEC0_MASK                   0x00000100
#define _SPI3STAT_SPIBEC0_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC1_POSITION               0x00000009
#define _SPI3STAT_SPIBEC1_MASK                   0x00000200
#define _SPI3STAT_SPIBEC1_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC2_POSITION               0x0000000A
#define _SPI3STAT_SPIBEC2_MASK                   0x00000400
#define _SPI3STAT_SPIBEC2_LENGTH                 0x00000001

#define _SPI3CON1_PPRE_POSITION                  0x00000000
#define _SPI3CON1_PPRE_MASK                      0x00000003
#define _SPI3CON1_PPRE_LENGTH                    0x00000002

#define _SPI3CON1_SPRE_POSITION                  0x00000002
#define _SPI3CON1_SPRE_MASK                      0x0000001C
#define _SPI3CON1_SPRE_LENGTH                    0x00000003

#define _SPI3CON1_MSTEN_POSITION                 0x00000005
#define _SPI3CON1_MSTEN_MASK                     0x00000020
#define _SPI3CON1_MSTEN_LENGTH                   0x00000001

#define _SPI3CON1_CKP_POSITION                   0x00000006
#define _SPI3CON1_CKP_MASK                       0x00000040
#define _SPI3CON1_CKP_LENGTH                     0x00000001

#define _SPI3CON1_SSEN_POSITION                  0x00000007
#define _SPI3CON1_SSEN_MASK                      0x00000080
#define _SPI3CON1_SSEN_LENGTH                    0x00000001

